# Lesson 12: A Very Brief Introduction to SQL Clauses

In [2]:
import pandas as pd
import numpy as np
import sqlite3

In [5]:
con = sqlite3.connect("data/chinook.db")

## Working with Dataframes

The function `pd.read_sql(sql, con)` returns the results from an SQL query as a data frame.

In [6]:
pd.read_sql("SELECT Title, artistID \
            FROM albums \
            LIMIT 10;", 
            con)

                                   Title  ArtistId
0  For Those About To Rock We Salute You         1
1                      Balls to the Wall         2
2                      Restless and Wild         2
3                      Let There Be Rock         1
4                               Big Ones         3
5                     Jagged Little Pill         4
6                               Facelift         5
7                         Warner 25 Anos         6
8         Plays Metallica By Four Cellos         7
9                             Audioslave         8